tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'johanhaleby/kubetail'
tap 'FairwindsOps/tap'
tap 'jlesquembre/kubeprompt', 'https://github.com/jlesquembre/kubeprompt'
tap 'romkatv/powerlevel10k'
tap 'hashicorp/tap'
tap 'github/gh'

brew 'ack'
brew 'aws-okta'  # hopeful not much longer...
brew 'bash'
brew 'binutils'
brew 'cmake'
brew 'colordiff'  # add color to your diffs ;)
brew 'consul'  # consul.io CLI
brew 'coreutils'
brew 'dep'
brew 'direnv' # load .envrc from a directory just by entering and existing the directory
brew 'ed'
brew 'findutils'
brew 'fzf'  # awesome fuzzy finder
brew 'gawk'
brew 'gh'
brew 'go'
brew 'gopass' # password store rewritten in go--failing on linux
brew 'grc'
brew 'git' # vcs of choice
brew 'git-delta' # better diffing
brew 'git-standup' # get standup info from git repositories
brew 'git-lfs'  # large file storage
brew 'grep' # gnu version -- find text in file or stdout/stderr
brew 'hh'  # hstr (better command history in zsh. ctrl-r)
brew 'hub'  # git wrapper by GitHub
brew 'hugo' # static site generator in go
brew 'imagemagick' # do cool stuff with images
brew 'jsonnet'  # templating language for :all_the_things:
brew 'jq' #parse json on the cli
brew 'kube-ps1'  # prompt for zsh
brew 'kubectl'
brew 'kubeprompt' # isolate kube context per environment
brew 'kubetail' # easier logging for kube
brew 'krew' # krew for kubernetes cli plugins
brew 'less' # updated version of less tool
brew 'make'
brew 'n'  # node version manager
brew 'neovim'  # better vim, don't install the one from Ubuntu PPAs
brew 'nextdns' # better, private, DOH provide (DNS)
brew 'openssl'
brew 'packer'  # most of my jobs will likely use Packer, I presume
brew 'pinentry-mac' # better popup and mgmt of auth prompts in gpg2 in osx
brew 'polaris'  # tool for validating kubernetes manifests
brew 'powerlevel10k' # ZSH prompt/theme
brew 'pssh' # ssh in parallel
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'ripgrep' # osx only, awesome fast searching
brew 'ruby'
brew 'ruby-build'
brew 'shellcheck'
brew 'spaceman-diff'
brew 'spark'
brew 'starship' # https://starship.rs => terminal prompt
brew 'task'  # taskwarrior
brew 'terraform'
brew 'terraform-ls'
brew 'the_silver_searcher' # ripgrep alternative prior to rg being written. Not as fast, but some tools still use it
brew 'tmux'
# brew 'unrar'
brew 'vault'  # Hashicorp Vault # failing because it needs node@10 apparrently, which is osx only
brew 'vegeta'  # load testing
brew 'watch'
brew 'wget' # curl alternative
brew 'xz'
brew 'yarn'  # , args: [ "without-node" ] # node package manager. Node is installed via 'n'
brew 'ykman'  # CLI for YubiKey Authenticator mgmt
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'alacritty'
