tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'johanhaleby/kubetail'
tap 'FairwindsOps/tap'
tap 'jlesquembre/kubeprompt', 'https://github.com/jlesquembre/kubeprompt'
# tap 'romkatv/powerlevel10k'
tap 'hashicorp/tap'
tap 'github/gh'
tap 'cantino/mcfly'

brew 'ack'
brew 'aws-okta'  # hopefully not much longer...
brew 'bash'
brew 'binutils'
brew 'cmake'
brew 'colordiff'  # add color to your diffs ;)
brew 'hashicorp/tap/consul'  # consul.io CLI
brew 'coreutils'
brew 'dep'
brew 'direnv'  # load .envrc from a directory just by entering and existing the directory
brew 'ed'
brew 'exa'  # a better ls as-per https://medium.com/@timonbimon/yet-another-step-by-step-guide-for-a-better-terminal-setup-6c5e879d4c8c
brew 'findutils'
brew 'fzf'  # awesome fuzzy finder
brew 'gawk'
brew 'gh'
brew 'go'
brew 'gopass'  # password store rewritten in go--failing on linux
brew 'grc'
brew 'git'  # vcs of choice
brew 'git-delta'  # better diffing
brew 'git-standup'  # get standup info from git repositories
brew 'git-lfs'  # large file storage
brew 'graphviz'
brew 'grep'  # gnu version -- find text in file or stdout/stderr
brew 'gnupg' # gpg v2
# brew 'hh'  # hstr (better command history in zsh. ctrl-r), testing out mcfly for now
brew 'hub'  # git wrapper by GitHub
brew 'hugo'  # static site generator in go
brew 'imagemagick'  # do cool stuff with images
brew 'jsonnet'  # templating language for :all_the_things:
brew 'jq'  # parse json on the cli
brew 'kube-ps1'  # prompt for zsh
brew 'kubectl'
brew 'kubeprompt'  # isolate kube context per environment
brew 'kubetail'  # easier logging for kube
# brew 'krew' # krew for kubernetes cli plugins
brew 'less'  # updated version of less tool
brew 'llvm'  # clangd for c LSP
brew 'make'
brew 'mcfly' # better ctrl-r with ML
brew 'mosh'  # better ssh
# brew 'n'  # node version manager
brew 'nvm'  # node version manager
brew 'neovim'  # , args: ["head"]  # better vim, don't install the one from Ubuntu PPAs
brew 'nextdns'  # better, private, DOH provide (DNS)
brew 'openssl'
brew 'packer'  # most of my jobs will likely use Packer, I presume
brew 'pinentry-mac'  # better popup and mgmt of auth prompts in gpg2 in osx
brew 'pipx'
# brew 'polaris'  # tool for validating kubernetes manifests
# brew 'powerlevel10k'  # ZSH prompt/theme
brew 'pssh'  # ssh in parallel
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'ripgrep'  # osx only, awesome fast searching
brew 'ruby'
brew 'ruby-build'
brew 'shellcheck'
brew 'spaceman-diff'
brew 'spark'
brew 'starship'  # https://starship.rs => terminal prompt
brew 'task'  # taskwarrior
brew 'terminal-notifier'  # allow sending notifications from cli
# brew 'hashicorp/tap/terraform' # remove and use tfenv instead
brew 'hashicorp/tap/terraform-ls'
# brew "terragrunt", args: ["ignore-dependencies"] # this will cause conflicts with tfenv, get Terragrunt from Github releases page
brew 'the_silver_searcher'  # ripgrep alternative prior to rg being written. Not as fast, but some tools still use it
brew 'tmux'
# brew 'unrar'
brew 'hashicorp/tap/vault'  # Hashicorp Vault
brew 'vegeta'  # load testing
brew 'watch'
brew 'wget'  # curl alternative
brew 'xz'
# brew 'yarn', args: [ "ignore-dependencies" ] # node package manager. Node is installed via 'n'
brew 'ykman'  # CLI for YubiKey Authenticator mgmt
brew 'zoxide' # better changing directories https://github.com/ajeetdsouza/zoxide
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask 'alacritty'
cask 'kitty'
