tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'johanhaleby/kubetail'
tap 'FairwindsOps/tap'
# tap 'jlesquembre/kubeprompt', 'https://github.com/jlesquembre/kubeprompt'
# tap 'romkatv/powerlevel10k'
tap 'hashicorp/tap'
tap 'github/gh'
tap 'cantino/mcfly'
# tap 'jesseduffield/lazygit/lazygit'
tap 'nvie/tap'
tap 'synfinatic/aws-sso-cli'

brew 'gofireflyio/aiac/aiac'  # AI for IaC -> https://github.com/gofireflyio/aiac
brew 'ack'
brew 'awscli'  # official aws-cli but managed through Homebrew so it stays updated 😄
brew 'synfinatic/aws-sso-cli/aws-sso-cli'  # better AWS SSO CLI
brew 'aws-okta'  # hopefully not much longer...
brew 'bash'
brew 'binutils'
brew 'bottom'  # process monitor
brew 'cmake'
brew 'colordiff'  # add color to your diffs ;)
brew 'hashicorp/tap/consul'  # consul.io CLI
brew 'coreutils'
brew 'dep'
brew 'direnv'  # load .envrc from a directory just by entering and existing the directory # noqa
brew 'ed'
brew 'exa'  # a better ls as-per https://medium.com/@timonbimon/yet-another-step-by-step-guide-for-a-better-terminal-setup-6c5e879d4c8c # noqa
brew 'fd'  # fd is a better find
brew 'findutils'
# brew 'font-jetbrains-mono-nerd-font'  # font used for my terminal
brew 'fzf'  # awesome fuzzy finder
brew 'gawk'
brew 'gh'
brew 'go'
brew 'gopass'  # password store rewritten in go--failing on linux
brew 'grc'
brew 'git'  # vcs of choice
brew 'git-delta'  # better diffing
brew 'git-standup'  # get standup info from git repositories
brew 'git-lfs'  # large file storage
brew 'nvie/tap/git-toolbelt'
brew 'gmp'  # gmp is needed for ruby in rbenv 🤷
brew 'gnupg'  # gpg v2
brew 'graphviz'
brew 'grep'  # gnu version -- find text in file or stdout/stderr
brew 'hstr'  # search zsh command history
brew 'hub'  # git wrapper by GitHub
brew 'hugo'  # static site generator in go
brew 'imagemagick'  # do cool stuff with images
brew 'infra-cli'  # docker internal cli
brew 'jless'  # JSON viewer with VIM keybindings
brew 'jsonnet'  # templating language for :all_the_things:
brew 'mike-engel/jwt-cli/jwt-cli' # jwt cli for easy local parsing of them
brew 'jq'  # parse json on the cli
brew 'kube-ps1'  # prompt for zsh
brew 'kubectl'
brew 'kubetail'  # easier logging for kube
brew 'jesseduffield/lazygit/lazygit'  # lazygit -- git with more power for the mortals
brew 'less'  # updated version of less tool
brew 'linkerd'  # linkerd cli for the service mesh tool
brew 'llvm'  # clangd for c LSP
brew 'make'
brew 'mcfly'  # better ctrl-r with ML
brew 'mosh'  # better ssh
brew 'nvm'  # node version manager
brew 'neovim'  # , args: ["HEAD"]  # better vim, don't install the one from Ubuntu PPAs # noqa
brew 'openssl'
brew 'packer'  # most of my jobs will likely use Packer, I presume
brew 'pinentry-mac'  # better popup and mgmt of auth prompts in gpg2 in osx
brew 'pipx'
brew 'pssh'  # ssh in parallel
brew 'rbenv'
brew 'readline'
brew 'redis'
brew 'ripgrep'  # osx only, awesome fast searching
brew 'ruby'
brew 'ruby-build'
brew 'shellcheck'
brew 'slides'  # slideshow in the terminal
brew 'spaceman-diff'
brew 'spark'
brew 'starship'  # https://starship.rs => terminal prompt
brew 'step'  # https://smallstep.com/cli/
# brew 'task'  # taskwarrior  # will overwrite the task binary from go-task
brew 'go-task/tap/go-task'  # https://taskfile.dev
brew 'terminal-notifier'  # allow sending notifications from cli
brew 'hashicorp/tap/terraform-ls'
brew 'the_silver_searcher'  # ripgrep alternative prior to rg being written. Not as fast, but some tools still use it # noqa
brew 'tfenv'  # Terraform version manager
brew 'tfsec'  # Terraform static analyzer => https://github.com/aquasecurity/tfsec
brew 'tmux'
brew 'hashicorp/tap/vault'  # Hashicorp Vault
brew 'vegeta'  # load testing
brew 'watch'
brew 'wget'  # curl alternative
brew 'xsv'  # csv cli tool => https://github.com/BurntSushi/xsv
brew 'xz'
brew 'ykman'  # CLI for YubiKey Authenticator mgmt
brew 'zoxide'  # better changing directories https://github.com/ajeetdsouza/zoxide # noqa
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zplug'

# cask 'alacritty'
cask 'kitty'
